# DamperExists Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..DamperExists Method
FabricationConfiguration Class See Also
---
Checks to see if the specified damper exists.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool DamperExists(
	int damperId
)
```

Visual Basic
---
```text
Public Function DamperExists ( _
	damperId As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool DamperExists(
	int damperId
)
```

# ### Parameters
damperId
    Type: System..::..Int32 The damper identifier to check.
# ### Return Value
Returns true if the damper exists.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace